pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       3225;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       3250;
    }
    side1
    {
        type            cyclicAMI;
        inGroups        List<word> 1(cyclicAMI);
        nFaces          250;
        startFace       3275;
        matchTolerance  0.0001;
        neighbourPatch  side2;
        transformType   rotational;
        rotationAxis    (1 0 0);
        rotationCentre  (0 0 0);
        rotationAngle   90;
        method          faceAreaWeightAMI;
    }
    side2
    {
        type            cyclicAMI;
        inGroups        List<word> 1(cyclicAMI);
        nFaces          250;
        startFace       3525;
        matchTolerance  0.0001;
        neighbourPatch  side1;
        transformType   rotational;
        rotationAxis    (1 0 0);
        rotationCentre  (0 0 0);
        rotationAngle   -90;
        method          faceAreaWeightAMI;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          250;
        startFace       3775;
    }
)

// ************************************************************************* //
